Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2019 Arm Limited (or its affiliates). All 
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        04. October 2019
 * $Revision:    V2.13
 *
 * Driver:       Driver_USART1, Driver_USART2, Driver_USART3, Driver_USART4,
 *               Driver_USART5, Driver_USART6, Driver_USART7, Driver_USART8,
 *               Driver_USART9, Driver_USART10
 * Configured:   via RTE_Device.h or MX_Device.h configuration file
 * Project:      USART Driver for ST STM32F4xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                   Value   UART Interface
 *   ---------------------                   -----   --------------
 *   Connect to hardware via Driver_USART# = 1       use USART1
 *   Connect to hardware via Driver_USART# = 2       use USART2
 *   Connect to hardware via Driver_USART# = 3       use USART3
 *   Connect to hardware via Driver_USART# = 4       use UART4
 *   Connect to hardware via Driver_USART# = 5       use UART5
 *   Connect to hardware via Driver_USART# = 6       use USART6
 *   Connect to hardware via Driver_USART# = 7       use UART7
 *   Connect to hardware via Driver_USART# = 8       use UART8
 *   Connect to hardware via Driver_USART# = 9       use UART9
 *   Connect to hardware via Driver_USART# = 10      use UART10
 * --------------------------------------------------------------------------
 *
 * When RTE_DEVICE_FRAMEWORK_CLASSIC is used:
 *  USART IO Speed frequencies can be defined by preprocessor:
 *    USARTx_GPIO_SPEED_FREQ (where x = 1,2,3 and 6) and 
 *    UARTy_GPIO_SPEED_FREQ (where y = 4,5,7,8,9 and 10) can be defined as:
 *      GPIO_SPEED_FREQ_LOW, GPIO_SPEED_FREQ_MEDIUM, 
 *      GPIO_SPEED_FREQ_HIGH or GPIO_SPEED_FREQ_VERY_HIGH
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 2.13
 *    Corrected DMA MemDataAlignment configuration.
 *  Version 2.12
 *    Corrected POWER_OFF sequence. DMA is DeInitialized after it is aborted.
 *  Version 2.11
 *    Added checking if pointer to USART_PIN is valid, before it is used.
 *  Version 2.10
 *    Added support for ARM Compiler 6
 *  Version 2.9
 *    Corrected condition for ARM_USART_SET_IRDA_PULSE control
 *  Version 2.8
 *    Added port configuration for ports supported by subfamily STM32F413, STM32F423.
 *    I/O output speed is configurable
 *  Version 2.7
 *    Added port configuration for ports supported by new subfamily.
 *  Version 2.6
 *    Corrected CTS handling and added Signal CTS change event.
 *  Version 2.5
 *    Corrected PowerControl function for:
 *      - Unconditional Power Off
 *      - Conditional Power full (driver must be initialized)
 *  Version 2.4
 *    Added support for STM32F410xx
 *    Corrected unwanted receive stop (Caused by calling USART_Receive function, while receiver is still busy.)
 *    Removed checking if Asynchronous Single-wire mode has been configured in CubeMX
 *  Version 2.3
 *    - Added RX Timeout handling
 *    - PowerControl for Power OFF and Uninitialize functions made unconditional.
 *    - Corrected status bit-field handling, to prevent race conditions.
 *  Version 2.2
 *    Added support for STM32F446xx
 *  Version 2.1
 *    STM32CubeMX generated code can also be used to configure the driver
 *  Version 2.0
 *    Updated to CMSIS Driver API V2.00
 *  Version 1.1
 *    Based on API V1.10 (namespace prefix ARM_ added)
 *  Version 1.0
 *    Initial release
 */

 /*! \page stm32f4_usart CMSIS-Driver USART Setup

The CMSIS-Driver USART requires:
  - Setup of USART/UART mode (Asynchronous, Synchronous, Single wire, IrDA or SmartCard)
  - Optional configuration of Hardware Flow Control (only in Asynchronous mode).
 
Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource | MCBSTM32F400        | MCBSTM32F400        | 32F401C-Discovery   | 32F429I-Discovery
:-------------------|:--------------------|:--------------------|:--------------------|:------------------
USART Peripheral    | USART1              | USART3/UART4        | USART2              | USART1
USART Mode          | <b>Asynchronous</b> | <b>Asynchronous</b> | <b>Asynchronous</b> | <b>Asynchronous</b>   
TX Pin              | PB6                 | PC10                | PA2                 | PA9
RX Pin              | PB7                 | PC11                | PA3                 | PA10

For different boards, refer to the hardware schematics to reflect correct setup values.

The STM32CubeMX configuration for MCBSTM32F400 with steps for Pinout, Clock, and System Configuration are 
listed below. Enter the values that are marked \b bold.
   
Pinout tab
----------
  1. Configure USART1 mode
     - Peripherals \b USART1: Mode=<b>Asynchronous</b>, Hardware Flow Control=<b>Disable</b>
          
Clock Configuration tab
-----------------------
  1. Configure USART1 Clock.
  
Configuration tab
-----------------
  1. Under Connectivity open \b USART1 Configuration:
     - \e optional <b>DMA Settings</b>: setup DMA transfers for Rx and Tx (DMA is optional)\n
       \b Add - Select \b USART1_RX: Stream=DMA2 Stream 2, DMA Request Settings: not used\n
       \b Add - Select \b USART1_TX: Stream=DMA2 Stream 7, DMA Request Settings: not used

     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin | GPIO mode | GPIO Pull-up/Pull..| Maximum out | User Label
          :--------|:--------------|:----------|:-------------------|:------------|:----------
          PB6      | USART1_TX     | Alternate | Pull-up            | High        |.  
          PB7      | USART1_RX     | Alternate | Pull-up            | High        |.
     - <b>NVIC Settings</b>: enable interrupts
          Interrupt Table                      | Enable | Preemption Priority | Sub Priority
          :------------------------------------|:-------|:--------------------|:--------------
          USART1 global interrupt              |\b ON   | 0                   | 0
          DMA2 stream2 global interrupt        |   ON   | 0                   | 0
          DMA2 stream7 global interrupt        |   ON   | 0                   | 0
     - Parameter Settings: not used
     - User Constants: not used
     - Click \b OK to close the USART1 Configuration dialog
*/
 
/*! \cond */

#include "USART_STM32F4xx.h"

#define ARM_USART_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(2,13)

// Driver Version
static const ARM_DRIVER_VERSION usart_driver_version = { ARM_USART_API_VERSION, ARM_USART_DRV_VERSION };

// USART1
#ifdef MX_USART1

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART1_VM == VM_ASYNC)
extern UART_HandleTypeDef huart1;
#elif (MX_USART1_VM == VM_SYNC)
extern USART_HandleTypeDef husart1;
#elif (MX_USART1_VM == VM_IRDA)
extern IRDA_HandleTypeDef hirda1;
#elif (MX_USART1_VM == VM_SMARTCARD)
extern SMARTCARD_HandleTypeDef hsc1;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

