Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
  // PINS
  {
#ifdef MX_USART2_TX_Pin
    &USART2_tx,
#else
    NULL,
#endif
#ifdef MX_USART2_RX_Pin
    &USART2_rx,
#else
    NULL,
#endif
#ifdef MX_USART2_CK_Pin
    &USART2_ck,
#else
    NULL,
#endif
#ifdef MX_USART2_RTS_Pin 
    &USART2_rts,
#else
    NULL,
#endif
#ifdef MX_USART2_CTS_Pin 
    &USART2_cts,
#else
    NULL,
#endif
  },

    USART2_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_USART2_TX_DMA_Instance
  &USART2_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_USART2_RX_DMA_Instance
  &USART2_DMA_Rx,
#else
  NULL,
#endif

  &USART2_Info,
  &USART2_TransferInfo
};
#endif

// USART3
#ifdef MX_USART3

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART3_VM == VM_ASYNC)
extern UART_HandleTypeDef huart3;
#elif (MX_USART3_VM == VM_SYNC)
extern USART_HandleTypeDef husart3;
#elif (MX_USART3_VM == VM_IRDA)
extern IRDA_HandleTypeDef hirda3;
#elif (MX_USART3_VM == VM_SMARTCARD)
extern SMARTCARD_HandleTypeDef hsc3;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// USART3 Run-Time Information
static USART_INFO          USART3_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO USART3_TransferInfo;

#ifdef MX_USART3_TX_Pin
  static USART_PIN USART3_tx =  {MX_USART3_TX_GPIOx,  MX_USART3_TX_GPIO_Pin,  MX_USART3_TX_GPIO_AF,  MX_USART3_TX_GPIO_PuPd,  MX_USART3_TX_GPIO_Speed};
#endif
#ifdef MX_USART3_RX_Pin
  static USART_PIN USART3_rx =  {MX_USART3_RX_GPIOx,  MX_USART3_RX_GPIO_Pin,  MX_USART3_RX_GPIO_AF,  MX_USART3_RX_GPIO_PuPd,  MX_USART3_RX_GPIO_Speed};
#endif
#ifdef MX_USART3_CK_Pin
  static USART_PIN USART3_ck =  {MX_USART3_CK_GPIOx,  MX_USART3_CK_GPIO_Pin,  MX_USART3_CK_GPIO_AF,  MX_USART3_CK_GPIO_PuPd,  MX_USART3_CK_GPIO_Speed};
#endif
#ifdef MX_USART3_RTS_Pin
  static USART_PIN USART3_rts = {MX_USART3_RTS_GPIOx, MX_USART3_RTS_GPIO_Pin, MX_USART3_RTS_GPIO_AF, MX_USART3_RTS_GPIO_PuPd, MX_USART3_RTS_GPIO_Speed};
#endif
#ifdef MX_USART3_CTS_Pin
  static USART_PIN USART3_cts = {MX_USART3_CTS_GPIOx, MX_USART3_CTS_GPIO_Pin, MX_USART3_CTS_GPIO_AF, MX_USART3_CTS_GPIO_PuPd, MX_USART3_CTS_GPIO_Speed};
#endif

#ifdef MX_USART3_TX_DMA_Instance
  static void USART3_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_usart3_tx;
#else
  extern DMA_HandleTypeDef hdma_usart3_tx;
#endif
  static USART_DMA USART3_DMA_Tx = {
    &hdma_usart3_tx,
    USART3_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_USART3_TX_DMA_Instance,
    MX_USART3_TX_DMA_Channel,
    MX_USART3_TX_DMA_Priority,
    MX_USART3_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_USART3_RX_DMA_Instance
  static void USART3_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_usart3_rx;
#else
  extern DMA_HandleTypeDef hdma_usart3_rx;
#endif
  static USART_DMA USART3_DMA_Rx = {
    &hdma_usart3_rx,
    USART3_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_USART3_RX_DMA_Instance,
    MX_USART3_RX_DMA_Channel,
    MX_USART3_RX_DMA_Priority,
    MX_USART3_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// USART3 Resources
static const USART_RESOURCES USART3_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART3_VM == VM_ASYNC)
  &huart3,
  VM_ASYNC,
#elif (MX_USART3_VM == VM_SYNC)
  &husart3,
  VM_SYNC,
#elif (MX_USART3_VM == VM_IRDA)
  &hirda3,
  VM_IRDA,
#elif (MX_USART3_VM == VM_SMARTCARD)
  &hsc3,
  VM_SMARTCARD,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#ifdef MX_USART3_CK_Pin
    1,  // supports Synchronous Master mode
#else
    0,  // supports Synchronous Master mode
#endif
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    1,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef MX_USART3_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef MX_USART3_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#ifdef MX_USART3_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef MX_USART3_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef MX_USART3_CTS_Pin
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    USART3,
    HAL_RCC_GetPCLK1Freq,

  // PINS
  {
#ifdef MX_USART3_TX_Pin
    &USART3_tx,
#else
    NULL,
#endif
#ifdef MX_USART3_RX_Pin
    &USART3_rx,
#else
    NULL,
#endif
#ifdef MX_USART3_CK_Pin
    &USART3_ck,
#else
    NULL,
#endif
#ifdef MX_USART3_RTS_Pin 
    &USART3_rts,
#else
    NULL,
#endif
#ifdef MX_USART3_CTS_Pin 
    &USART3_cts,
#else
    NULL,
#endif
  },

    USART3_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_USART3_TX_DMA_Instance
  &USART3_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_USART3_RX_DMA_Instance
  &USART3_DMA_Rx,
#else
  NULL,
#endif

  &USART3_Info,
  &USART3_TransferInfo
};
#endif

// UART4
#ifdef MX_UART4

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART4_VM == Asynchronous)
extern UART_HandleTypeDef huart4;
#elif (MX_UART4_VM == IrDA)
extern IRDA_HandleTypeDef hirda4;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// UART4 Run-Time Information
static USART_INFO          UART4_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO UART4_TransferInfo;

#ifdef MX_UART4_TX_Pin
  static USART_PIN UART4_tx = {MX_UART4_TX_GPIOx,  MX_UART4_TX_GPIO_Pin,  MX_UART4_TX_GPIO_AF, MX_UART4_TX_GPIO_PuPd, MX_UART4_TX_GPIO_Speed};
#endif
#ifdef MX_UART4_RX_Pin
  static USART_PIN UART4_rx = {MX_UART4_RX_GPIOx,  MX_UART4_RX_GPIO_Pin,  MX_UART4_RX_GPIO_AF, MX_UART4_RX_GPIO_PuPd, MX_UART4_RX_GPIO_Speed};
#endif

#ifdef MX_UART4_TX_DMA_Instance
  static void UART4_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart4_tx;
#else
  extern DMA_HandleTypeDef hdma_uart4_tx;
#endif
  static USART_DMA UART4_DMA_Tx = {
    &hdma_uart4_tx,
    UART4_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART4_TX_DMA_Instance,
    MX_UART4_TX_DMA_Channel,
    MX_UART4_TX_DMA_Priority,
    MX_UART4_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_UART4_RX_DMA_Instance
  static void UART4_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart4_rx;
#else
  extern DMA_HandleTypeDef hdma_uart4_rx;
#endif
  static USART_DMA UART4_DMA_Rx = {
    &hdma_uart4_rx,
    UART4_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART4_RX_DMA_Instance,
    MX_UART4_RX_DMA_Channel,
    MX_UART4_RX_DMA_Priority,
    MX_UART4_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// UART4 Resources
static const USART_RESOURCES USART4_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART4_VM == Asynchronous)
  &huart4,
  VM_ASYNC,
#elif (MX_UART4_VM == IrDA)
  &hirda4,
  VM_IRDA,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    UART4,
    HAL_RCC_GetPCLK1Freq,

