Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
// USART6 Resources
static const USART_RESOURCES USART6_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART6_VM == VM_ASYNC)
  &huart6,
  VM_ASYNC,
#elif (MX_USART6_VM == VM_SYNC)
  &husart6,
  VM_SYNC,
#elif (MX_USART6_VM == VM_IRDA)
  &hirda6,
  VM_IRDA,
#elif (MX_USART6_VM == VM_SMARTCARD)
  &hsc6,
  VM_SMARTCARD,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#ifdef MX_USART6_CK_Pin
    1,  // supports Synchronous Master mode
#else
    0,  // supports Synchronous Master mode
#endif
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    1,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef MX_USART6_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef MX_USART6_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#ifdef MX_USART6_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef MX_USART6_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef MX_USART6_CTS_Pin
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    USART6,
    HAL_RCC_GetPCLK2Freq,

  // PINS
  {
#ifdef MX_USART6_TX_Pin
    &USART6_tx,
#else
    NULL,
#endif
#ifdef MX_USART6_RX_Pin
    &USART6_rx,
#else
    NULL,
#endif
#ifdef MX_USART6_CK_Pin
    &USART6_ck,
#else
    NULL,
#endif
#ifdef MX_USART6_RTS_Pin 
    &USART6_rts,
#else
    NULL,
#endif
#ifdef MX_USART6_CTS_Pin 
    &USART6_cts,
#else
    NULL,
#endif
  },

    USART6_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_USART6_TX_DMA_Instance
  &USART6_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_USART6_RX_DMA_Instance
  &USART6_DMA_Rx,
#else
  NULL,
#endif

  &USART6_Info,
  &USART6_TransferInfo
};
#endif

// UART7
#ifdef MX_UART7

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART7_VM == Asynchronous)
extern UART_HandleTypeDef huart7;
#elif (MX_UART7_VM == IrDA)
extern IRDA_HandleTypeDef hirda7;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// UART7 Run-Time Information
static USART_INFO          UART7_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO UART7_TransferInfo;

#ifdef MX_UART7_TX_Pin
  static USART_PIN UART7_tx = {MX_UART7_TX_GPIOx,  MX_UART7_TX_GPIO_Pin,  MX_UART7_TX_GPIO_AF, MX_UART7_TX_GPIO_PuPd, MX_UART7_TX_GPIO_Speed};
#endif
#ifdef MX_UART7_RX_Pin
  static USART_PIN UART7_rx = {MX_UART7_RX_GPIOx,  MX_UART7_RX_GPIO_Pin,  MX_UART7_RX_GPIO_AF, MX_UART7_RX_GPIO_PuPd, MX_UART7_RX_GPIO_Speed};
#endif

#ifdef MX_UART7_TX_DMA_Instance
  static void UART7_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart7_tx;
#else
  extern DMA_HandleTypeDef hdma_uart7_tx;
#endif
  static USART_DMA UART7_DMA_Tx = {
    &hdma_uart7_tx,
    UART7_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART7_TX_DMA_Instance,
    MX_UART7_TX_DMA_Channel,
    MX_UART7_TX_DMA_Priority,
    MX_UART7_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_UART7_RX_DMA_Instance
  static void UART7_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart7_rx;
#else
  extern DMA_HandleTypeDef hdma_uart7_rx;
#endif
  static USART_DMA UART7_DMA_Rx = {
    &hdma_uart7_rx,
    UART7_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART7_RX_DMA_Instance,
    MX_UART7_RX_DMA_Channel,
    MX_UART7_RX_DMA_Priority,
    MX_UART7_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// UART7 Resources
static const USART_RESOURCES USART7_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART7_VM == Asynchronous)
  &huart7,
  VM_ASYNC,
#elif (MX_UART7_VM == IrDA)
  &hirda7,
  VM_IRDA,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0,  // Signal RI change event: \ref ARM_USART_EVENT_RI
  },

    UART7,
    HAL_RCC_GetPCLK1Freq,

  // PINS
  {
#ifdef MX_UART7_TX_Pin
    &UART7_tx,
#else
    NULL,
#endif
#ifdef MX_UART7_RX_Pin
    &UART7_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
  },

    UART7_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_UART7_TX_DMA_Instance
  &UART7_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_UART7_RX_DMA_Instance
  &UART7_DMA_Rx,
#else
  NULL,
#endif

