Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
  &UART7_Info,
  &UART7_TransferInfo
};
#endif

// UART8
#ifdef MX_UART8

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART8_VM == Asynchronous)
extern UART_HandleTypeDef huart8;
#elif (MX_UART8_VM == IrDA)
extern IRDA_HandleTypeDef hirda8;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// UART8 Run-Time Information
static USART_INFO          UART8_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO UART8_TransferInfo;

#ifdef MX_UART8_TX_Pin
  static USART_PIN UART8_tx = {MX_UART8_TX_GPIOx,  MX_UART8_TX_GPIO_Pin,  MX_UART8_TX_GPIO_AF, MX_UART8_TX_GPIO_PuPd, MX_UART8_TX_GPIO_Speed};
#endif
#ifdef MX_UART8_RX_Pin
  static USART_PIN UART8_rx = {MX_UART8_RX_GPIOx,  MX_UART8_RX_GPIO_Pin,  MX_UART8_RX_GPIO_AF, MX_UART8_RX_GPIO_PuPd, MX_UART8_RX_GPIO_Speed};
#endif

#ifdef MX_UART8_TX_DMA_Instance
  static void UART8_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart8_tx;
#else
  extern DMA_HandleTypeDef hdma_uart8_tx;
#endif
  static USART_DMA UART8_DMA_Tx = {
    &hdma_uart8_tx,
    UART8_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART8_TX_DMA_Instance,
    MX_UART8_TX_DMA_Channel,
    MX_UART8_TX_DMA_Priority,
    MX_UART8_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_UART8_RX_DMA_Instance
  static void UART8_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart8_rx;
#else
  extern DMA_HandleTypeDef hdma_uart8_rx;
#endif
  static USART_DMA UART8_DMA_Rx = {
    &hdma_uart8_rx,
    UART8_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART8_RX_DMA_Instance,
    MX_UART8_RX_DMA_Channel,
    MX_UART8_RX_DMA_Priority,
    MX_UART8_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// UART8 Resources
static const USART_RESOURCES USART8_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART8_VM == Asynchronous)
  &huart8,
  VM_ASYNC,
#elif (MX_UART8_VM == IrDA)
  &hirda8,
  VM_IRDA,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    UART8,
    HAL_RCC_GetPCLK1Freq,

  // PINS
  {
#ifdef MX_UART8_TX_Pin
    &UART8_tx,
#else
    NULL,
#endif
#ifdef MX_UART8_RX_Pin
    &UART8_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
  },

    UART8_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_UART8_TX_DMA_Instance
  &UART8_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_UART8_RX_DMA_Instance
  &UART8_DMA_Rx,
#else
  NULL,
#endif

  &UART8_Info,
  &UART8_TransferInfo
};
#endif

// UART9
#ifdef MX_UART9

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART9_VM == Asynchronous)
extern UART_HandleTypeDef huart9;
#elif (MX_UART9_VM == IrDA)
extern IRDA_HandleTypeDef hirda9;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// UART9 Run-Time Information
static USART_INFO          UART9_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO UART9_TransferInfo;

#ifdef MX_UART9_TX_Pin
  static USART_PIN UART9_tx = {MX_UART9_TX_GPIOx,  MX_UART9_TX_GPIO_Pin,  MX_UART9_TX_GPIO_AF, MX_UART9_TX_GPIO_PuPd, MX_UART9_TX_GPIO_Speed};
#endif
#ifdef MX_UART9_RX_Pin
  static USART_PIN UART9_rx = {MX_UART9_RX_GPIOx,  MX_UART9_RX_GPIO_Pin,  MX_UART9_RX_GPIO_AF, MX_UART9_RX_GPIO_PuPd, MX_UART9_RX_GPIO_Speed};
#endif

#ifdef MX_UART9_TX_DMA_Instance
  static void UART9_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart9_tx;
#else
  extern DMA_HandleTypeDef hdma_uart9_tx;
#endif
  static USART_DMA UART9_DMA_Tx = {
    &hdma_uart9_tx,
    UART9_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART9_TX_DMA_Instance,
    MX_UART9_TX_DMA_Channel,
    MX_UART9_TX_DMA_Priority,
    MX_UART9_TX_DMA_IRQn
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_UART9_RX_DMA_Instance
  static void UART9_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart9_rx;
#else
  extern DMA_HandleTypeDef hdma_uart9_rx;
#endif
  static USART_DMA UART9_DMA_Rx = {
    &hdma_uart9_rx,
    UART9_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART9_RX_DMA_Instance,
    MX_UART9_RX_DMA_Channel,
    MX_UART9_RX_DMA_Priority,
    MX_UART9_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// UART9 Resources
static const USART_RESOURCES USART9_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART9_VM == Asynchronous)
  &huart9,
  VM_ASYNC,
#elif (MX_UART9_VM == IrDA)
  &hirda9,
  VM_IRDA,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    UART9,
    HAL_RCC_GetPCLK2Freq,

