Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
  // PINS
  {
#ifdef MX_UART9_TX_Pin
    &UART9_tx,
#else
    NULL,
#endif
#ifdef MX_UART9_RX_Pin
    &UART9_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
  },

    UART9_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_UART9_TX_DMA_Instance
  &UART9_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_UART9_RX_DMA_Instance
  &UART9_DMA_Rx,
#else
  NULL,
#endif

  &UART9_Info,
  &UART9_TransferInfo
};
#endif

// UART10
#ifdef MX_UART10

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART10_VM == Asynchronous)
extern UART_HandleTypeDef huart10;
#elif (MX_UART10_VM == IrDA)
extern IRDA_HandleTypeDef hirda10;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// UART10 Run-Time Information
static USART_INFO          UART10_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO UART10_TransferInfo;

#ifdef MX_UART10_TX_Pin
  static USART_PIN UART10_tx = {MX_UART10_TX_GPIOx,  MX_UART10_TX_GPIO_Pin,  MX_UART10_TX_GPIO_AF, MX_UART10_TX_GPIO_PuPd, MX_UART10_TX_GPIO_Speed};
#endif
#ifdef MX_UART10_RX_Pin
  static USART_PIN UART10_rx = {MX_UART10_RX_GPIOx,  MX_UART10_RX_GPIO_Pin,  MX_UART10_RX_GPIO_AF, MX_UART10_RX_GPIO_PuPd, MX_UART10_RX_GPIO_Speed};
#endif

#ifdef MX_UART10_TX_DMA_Instance
  static void UART10_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart10_tx;
#else
  extern DMA_HandleTypeDef hdma_uart10_tx;
#endif
  static USART_DMA UART10_DMA_Tx = {
    &hdma_uart10_tx,
    UART10_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART10_TX_DMA_Instance,
    MX_UART10_TX_DMA_Channel,
    MX_UART10_TX_DMA_Priority,
    MX_UART10_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_UART10_RX_DMA_Instance
  static void UART10_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart10_rx;
#else
  extern DMA_HandleTypeDef hdma_uart10_rx;
#endif
  static USART_DMA UART10_DMA_Rx = {
    &hdma_uart10_rx,
    UART10_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART10_RX_DMA_Instance,
    MX_UART10_RX_DMA_Channel,
    MX_UART10_RX_DMA_Priority,
    MX_UART10_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// UART10 Resources
static const USART_RESOURCES USART10_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART10_VM == Asynchronous)
  &huart10,
  VM_ASYNC,
#elif (MX_UART10_VM == IrDA)
  &hirda10,
  VM_IRDA,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    UART10,
    HAL_RCC_GetPCLK2Freq,

  // PINS
  {
#ifdef MX_UART10_TX_Pin
    &UART10_tx,
#else
    NULL,
#endif
#ifdef MX_UART10_RX_Pin
    &UART10_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
  },

    UART10_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_UART10_TX_DMA_Instance
  &UART10_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_UART10_RX_DMA_Instance
  &UART10_DMA_Rx,
#else
  NULL,
#endif

  &UART10_Info,
  &UART10_TransferInfo
};
#endif

// Function prototypes
void USART_IRQHandler (const USART_RESOURCES *usart);
#ifdef __USART_DMA_TX
static void USART_TX_DMA_Complete(const USART_RESOURCES *usart);
#endif
#ifdef __USART_DMA_RX
static void USART_RX_DMA_Complete(const USART_RESOURCES *usart);
#endif
static int32_t USART_Receive (      void            *data,
                                    uint32_t         num,
                              const USART_RESOURCES *usart);


#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
/**
  \fn          void Enable_GPIO_Clock (GPIO_TypeDef *port)
  \brief       Enable GPIO clock
*/
static void Enable_GPIO_Clock (GPIO_TypeDef *GPIOx) {
#ifdef GPIOA
  if (GPIOx == GPIOA) __GPIOA_CLK_ENABLE();
#endif 
#ifdef GPIOB
  if (GPIOx == GPIOB) __GPIOB_CLK_ENABLE();
#endif
#ifdef GPIOC
  if (GPIOx == GPIOC) __GPIOC_CLK_ENABLE();
#endif
#ifdef GPIOD
  if (GPIOx == GPIOD) __GPIOD_CLK_ENABLE();
#endif
#ifdef GPIOE
  if (GPIOx == GPIOE) __GPIOE_CLK_ENABLE();
#endif
#ifdef GPIOF
  if (GPIOx == GPIOF) __GPIOF_CLK_ENABLE();
#endif
#ifdef GPIOG
  if (GPIOx == GPIOG) __GPIOG_CLK_ENABLE();
#endif
#ifdef GPIOH
  if (GPIOx == GPIOH) __GPIOH_CLK_ENABLE();
#endif
#ifdef GPIOI
  if (GPIOx == GPIOI) __GPIOI_CLK_ENABLE();
#endif
}
#endif

/**
  \fn          void USART_PeripheralReset (USART_TypeDef *usart)
  \brief       USART Reset
*/
static void USART_PeripheralReset (USART_TypeDef *usart) {
  
  if      (usart == USART1) { __HAL_RCC_USART1_FORCE_RESET(); }
  else if (usart == USART2) { __HAL_RCC_USART2_FORCE_RESET(); }
#ifdef USART3
  else if (usart == USART3) { __HAL_RCC_USART3_FORCE_RESET(); }
#endif
#ifdef UART4
  else if (usart == UART4)  { __HAL_RCC_UART4_FORCE_RESET();  }
#endif
#ifdef UART5
  else if (usart == UART5)  { __HAL_RCC_UART5_FORCE_RESET();  }
#endif
#ifdef USART6
  else if (usart == USART6) { __HAL_RCC_USART6_FORCE_RESET(); }
#endif
#ifdef UART7
  else if (usart == UART7)  { __HAL_RCC_UART7_FORCE_RESET();  }
#endif
#ifdef UART8
  else if (usart == UART8)  { __HAL_RCC_UART8_FORCE_RESET();  }
#endif
#ifdef UART9
  else if (usart == UART9)  { __HAL_RCC_UART9_FORCE_RESET();  }
#endif
#ifdef UART10
  else if (usart == UART10) { __HAL_RCC_UART10_FORCE_RESET(); }
#endif

  __NOP(); __NOP(); __NOP(); __NOP();

  if      (usart == USART1) { __HAL_RCC_USART1_RELEASE_RESET(); }
  else if (usart == USART2) { __HAL_RCC_USART2_RELEASE_RESET(); }
#ifdef USART3
  else if (usart == USART3) { __HAL_RCC_USART3_RELEASE_RESET(); }
#endif
#ifdef UART4
  else if (usart == UART4)  { __HAL_RCC_UART4_RELEASE_RESET();  }
#endif
#ifdef UART5
  else if (usart == UART5)  { __HAL_RCC_UART5_RELEASE_RESET();  }
#endif
#ifdef USART6
  else if (usart == USART6) { __HAL_RCC_USART6_RELEASE_RESET(); }
#endif
#ifdef UART7
  else if (usart == UART7)  { __HAL_RCC_UART7_RELEASE_RESET();  }
#endif
#ifdef UART8
  else if (usart == UART8)  { __HAL_RCC_UART8_RELEASE_RESET();  }
#endif
#ifdef UART9
  else if (usart == UART9)  { __HAL_RCC_UART9_RELEASE_RESET();  }
#endif
#ifdef UART10
  else if (usart == UART10) { __HAL_RCC_UART10_RELEASE_RESET(); }
#endif
}


