Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
// USART Driver functions

/**
  \fn          ARM_DRIVER_VERSION USARTx_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USARTx_GetVersion (void) {
  return usart_driver_version;
}

/**
  \fn          ARM_USART_CAPABILITIES USART_GetCapabilities (const USART_RESOURCES *usart)
  \brief       Get driver capabilities
  \param[in]   usart     Pointer to USART resources
  \return      \ref ARM_USART_CAPABILITIES
*/
static ARM_USART_CAPABILITIES USART_GetCapabilities (const USART_RESOURCES *usart) {
  return usart->capabilities;
}

/**
  \fn          int32_t USART_Initialize (      ARM_USART_SignalEvent_t  cb_event
                                         const USART_RESOURCES         *usart)
  \brief       Initialize USART Interface.
  \param[in]   cb_event  Pointer to \ref ARM_USART_SignalEvent
  \param[in]   usart     Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_Initialize (      ARM_USART_SignalEvent_t  cb_event,
                                 const USART_RESOURCES         *usart) {

  if (usart->info->flags & USART_FLAG_INITIALIZED) {
    // Driver is already initialized
    return ARM_DRIVER_OK;
  }

  // Initialize USART Run-time Resources
  usart->info->cb_event = cb_event;

  usart->info->status.tx_busy          = 0U;
  usart->info->status.rx_busy          = 0U;
  usart->info->status.tx_underflow     = 0U;
  usart->info->status.rx_overflow      = 0U;
  usart->info->status.rx_break         = 0U;
  usart->info->status.rx_framing_error = 0U;
  usart->info->status.rx_parity_error  = 0U;

  usart->info->mode        = 0U;
  usart->xfer->send_active = 0U;

  // Clear transfer information
  memset((void *)usart->xfer, 0, sizeof(USART_TRANSFER_INFO));

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  // Enable TX pin port clock
  if (usart->io.tx) {
    Enable_GPIO_Clock (usart->io.tx->port);
  }

  // Enable RX pin port clock
  if (usart->io.rx) {
    Enable_GPIO_Clock (usart->io.rx->port);
  }

  // Enable CLK pin port clock
  if (usart->io.ck) {
    Enable_GPIO_Clock (usart->io.ck->port);
  }

  // Configure RTS pin
  if (usart->io.rts) {
    Enable_GPIO_Clock (usart->io.rts->port);
  }

  // Configure CTS pin
  if (usart->io.cts) {
    Enable_GPIO_Clock (usart->io.cts->port);
  }

#ifdef __USART_DMA
  if (usart->dma_rx) {
    // Initialize USART RX DMA Resources
    memset((void *)usart->dma_rx->hdma, 0U, sizeof(DMA_HandleTypeDef));
    usart->dma_rx->hdma->Instance             = usart->dma_rx->stream;
    usart->dma_rx->hdma->Init.Channel         = usart->dma_rx->channel;
    usart->dma_rx->hdma->Init.Direction       = DMA_PERIPH_TO_MEMORY;
    usart->dma_rx->hdma->Init.Mode            = DMA_NORMAL;
    usart->dma_rx->hdma->Init.Priority        = usart->dma_rx->priority;
    usart->dma_rx->hdma->Init.FIFOMode        = DMA_FIFOMODE_DISABLE;
    usart->dma_rx->hdma->Init.FIFOThreshold   = DMA_FIFO_THRESHOLD_FULL;
    usart->dma_rx->hdma->Init.MemBurst        = DMA_MBURST_SINGLE;
    usart->dma_rx->hdma->Init.PeriphBurst     = DMA_PBURST_SINGLE;
    usart->dma_rx->hdma->Parent               = NULL;
    usart->dma_rx->hdma->XferCpltCallback     = usart->dma_rx->cb_complete;
    usart->dma_rx->hdma->XferHalfCpltCallback = NULL;
    usart->dma_rx->hdma->XferM1CpltCallback   = NULL;
    usart->dma_rx->hdma->XferErrorCallback    = NULL;
  }

  if (usart->dma_tx) {
    // Initialize USART TX DMA Resources
    memset((void *)usart->dma_tx->hdma, 0U, sizeof(DMA_HandleTypeDef));
    usart->dma_tx->hdma->Instance             = usart->dma_tx->stream;
    usart->dma_tx->hdma->Init.Channel         = usart->dma_tx->channel;
    usart->dma_tx->hdma->Init.Direction       = DMA_MEMORY_TO_PERIPH;
    usart->dma_tx->hdma->Init.Mode            = DMA_NORMAL;
    usart->dma_tx->hdma->Init.Priority        = usart->dma_tx->priority;
    usart->dma_tx->hdma->Init.FIFOMode        = DMA_FIFOMODE_DISABLE;
    usart->dma_tx->hdma->Init.FIFOThreshold   = DMA_FIFO_THRESHOLD_FULL;
    usart->dma_tx->hdma->Init.MemBurst        = DMA_MBURST_SINGLE;
    usart->dma_tx->hdma->Init.PeriphBurst     = DMA_PBURST_SINGLE;
    usart->dma_tx->hdma->Parent               = NULL;
    usart->dma_tx->hdma->XferCpltCallback     = usart->dma_tx->cb_complete;
    usart->dma_tx->hdma->XferHalfCpltCallback = NULL;
    usart->dma_tx->hdma->XferM1CpltCallback   = NULL;
    usart->dma_tx->hdma->XferErrorCallback    = NULL;
  }

  // Enable DMA clock
  if ((usart->reg == USART1) || (usart->reg == USART6)) {
    // DMA2 used for USART1 and USART6
    __DMA2_CLK_ENABLE();
  } else {
    __DMA1_CLK_ENABLE();
  }
#endif
#else
  if (usart->dma_rx) {
    usart->dma_rx->hdma->XferCpltCallback = usart->dma_rx->cb_complete;
  }
  if (usart->dma_tx) {
    usart->dma_tx->hdma->XferCpltCallback = usart->dma_tx->cb_complete;
  }
#endif

  usart->info->flags = USART_FLAG_INITIALIZED;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USART_Uninitialize (const USART_RESOURCES *usart)
  \brief       De-initialize USART Interface.
  \param[in]   usart     Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_Uninitialize (const USART_RESOURCES *usart) {

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  // Unconfigure USART pins
  if (usart->io.tx)  { HAL_GPIO_DeInit(usart->io.tx->port,  usart->io.tx->pin);  }
  if (usart->io.rx)  { HAL_GPIO_DeInit(usart->io.rx->port,  usart->io.rx->pin);  }
  if (usart->io.ck)  { HAL_GPIO_DeInit(usart->io.ck->port,  usart->io.ck->pin);  }
  if (usart->io.rts) { HAL_GPIO_DeInit(usart->io.rts->port, usart->io.rts->pin); }
  if (usart->io.cts) { HAL_GPIO_DeInit(usart->io.cts->port, usart->io.cts->pin); }

  if (usart->dma_rx) { usart->dma_rx->hdma->Instance = NULL; }
  if (usart->dma_tx) { usart->dma_tx->hdma->Instance = NULL; }
#else

  switch (usart->vmode) {
#ifdef USART_ASYNC
    case VM_ASYNC:
      ((UART_HandleTypeDef*)usart->h)->Instance      = NULL;
      break;
#endif
#ifdef USART_SYNC
    case VM_SYNC:
      ((USART_HandleTypeDef*)usart->h)->Instance     = NULL;
      break;
#endif
#ifdef USART_IRDA
    case VM_IRDA:
      ((IRDA_HandleTypeDef*)usart->h)->Instance      = NULL;
      break;
#endif
#ifdef USART_SMARTCARD
    case VM_SMARTCARD:
      ((SMARTCARD_HandleTypeDef*)usart->h)->Instance = NULL;
      break;
#endif
  }
#endif

  // Reset USART status flags
  usart->info->flags = 0U;

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USART_PowerControl (ARM_POWER_STATE state)
  \brief       Control USART Interface Power.
  \param[in]   state  Power state
  \param[in]   usart  Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_PowerControl (      ARM_POWER_STATE  state,
                                   const USART_RESOURCES *usart) {

  if ((state != ARM_POWER_OFF)  && 
      (state != ARM_POWER_FULL) && 
      (state != ARM_POWER_LOW)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  switch (state) {
    case ARM_POWER_OFF:
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      HAL_NVIC_DisableIRQ (usart->irq_num);
#ifdef __USART_DMA
      if (usart->dma_rx) {
        if (usart->dma_rx->hdma->Instance) {
          if (usart->info->status.rx_busy != 0) {
            // DMA disable receiver
            usart->reg->CR3 &= ~USART_CR3_DMAR;
            // Abort RX DMA transfer
            HAL_DMA_Abort (usart->dma_rx->hdma);
          }
          // Disable DMA IRQ in NVIC
          HAL_NVIC_DisableIRQ (usart->dma_rx->irq_num);
          // Deinitialize DMA
          HAL_DMA_DeInit (usart->dma_rx->hdma);
        }
      }

      if (usart->dma_tx) {
        if (usart->dma_tx->hdma->Instance) {
          if (usart->info->status.tx_busy != 0) {
            // DMA disable transmitter
            usart->reg->CR3 &= ~USART_CR3_DMAT;
            // Abort TX DMA transfer
            HAL_DMA_Abort (usart->dma_tx->hdma);
          }
          // Disable DMA IRQ in NVIC
          HAL_NVIC_DisableIRQ (usart->dma_tx->irq_num);
          // Deinitialize DMA
          HAL_DMA_DeInit (usart->dma_tx->hdma);
        }
      }
      // USART peripheral reset
      USART_PeripheralReset (usart->reg);
#endif
#else
      // USART peripheral reset
      USART_PeripheralReset (usart->reg);
      switch (usart->vmode) {
#ifdef USART_ASYNC
        case VM_ASYNC:
          if (((UART_HandleTypeDef*)usart->h)->Instance != NULL) {
            HAL_UART_MspDeInit ((UART_HandleTypeDef*) usart->h);
          }
          break;
#endif
#ifdef USART_SYNC
        case VM_SYNC:
          if (((USART_HandleTypeDef*)usart->h)->Instance != NULL) {
            HAL_USART_MspDeInit ((USART_HandleTypeDef*) usart->h);
          }
          break;
#endif
#ifdef USART_IRDA
        case VM_IRDA:
          if (((IRDA_HandleTypeDef*)usart->h)->Instance != NULL) {
            HAL_IRDA_MspDeInit ((IRDA_HandleTypeDef*) usart->h);
          }
          break;
#endif
#ifdef USART_SMARTCARD
        case VM_SMARTCARD:
          if (((SMARTCARD_HandleTypeDef*)usart->h)->Instance != NULL) {
            HAL_SMARTCARD_MspDeInit ((SMARTCARD_HandleTypeDef*) usart->h);
          }
          break;
#endif
        default: break;
      }
#endif

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      // Disable USART clock
      if      (usart->reg == USART1) { __HAL_RCC_USART1_CLK_DISABLE(); }
      else if (usart->reg == USART2) { __HAL_RCC_USART2_CLK_DISABLE(); }
    #ifdef USART3
      else if (usart->reg == USART3) { __HAL_RCC_USART3_CLK_DISABLE(); }
    #endif
    #ifdef UART4
      else if (usart->reg == UART4)  { __HAL_RCC_UART4_CLK_DISABLE();  }
    #endif
    #ifdef UART5
      else if (usart->reg == UART5)  { __HAL_RCC_UART5_CLK_DISABLE();  }
    #endif
    #ifdef USART6
      else if (usart->reg == USART6) { __HAL_RCC_USART6_CLK_DISABLE(); }
    #endif
    #ifdef UART7
      else if (usart->reg == UART7)  { __HAL_RCC_UART7_CLK_DISABLE();  }
    #endif
    #ifdef UART8
      else if (usart->reg == UART8)  { __HAL_RCC_UART8_CLK_DISABLE();  }
    #endif
    #ifdef UART9
      else if (usart->reg == UART9)  { __HAL_RCC_UART9_CLK_DISABLE();  }
    #endif
    #ifdef UART10
      else if (usart->reg == UART10) { __HAL_RCC_UART10_CLK_DISABLE(); }
    #endif
#endif

