Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
      // Clear Status flags
      usart->info->status.tx_busy          = 0U;
      usart->info->status.rx_busy          = 0U;
      usart->info->status.tx_underflow     = 0U;
      usart->info->status.rx_overflow      = 0U;
      usart->info->status.rx_break         = 0U;
      usart->info->status.rx_framing_error = 0U;
      usart->info->status.rx_parity_error  = 0U;
      usart->xfer->send_active             = 0U;

      usart->info->flags &= ~USART_FLAG_POWERED;
      break;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    case ARM_POWER_FULL:
      if ((usart->info->flags & USART_FLAG_INITIALIZED) == 0U) {
        return ARM_DRIVER_ERROR;
      }
      if ((usart->info->flags & USART_FLAG_POWERED)     != 0U) {
        return ARM_DRIVER_OK;
      }

      // Clear Status flags
      usart->info->status.tx_busy          = 0U;
      usart->info->status.rx_busy          = 0U;
      usart->info->status.tx_underflow     = 0U;
      usart->info->status.rx_overflow      = 0U;
      usart->info->status.rx_break         = 0U;
      usart->info->status.rx_framing_error = 0U;
      usart->info->status.rx_parity_error  = 0U;

      usart->xfer->send_active             = 0U;
      usart->xfer->def_val                 = 0U;
      usart->xfer->sync_mode               = 0U;
      usart->xfer->break_flag              = 0U;
      usart->info->mode                    = 0U;
      usart->info->flow_control            = 0U;

      usart->info->flags = USART_FLAG_POWERED | USART_FLAG_INITIALIZED;

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
      // Enable USART clock
      if      (usart->reg == USART1) { __HAL_RCC_USART1_CLK_ENABLE(); }
      else if (usart->reg == USART2) { __HAL_RCC_USART2_CLK_ENABLE(); }
    #ifdef USART3
      else if (usart->reg == USART3) { __HAL_RCC_USART3_CLK_ENABLE(); }
    #endif
    #ifdef UART4
      else if (usart->reg == UART4)  { __HAL_RCC_UART4_CLK_ENABLE();  }
    #endif
    #ifdef UART5
      else if (usart->reg == UART5)  { __HAL_RCC_UART5_CLK_ENABLE();  }
    #endif
    #ifdef USART6
      else if (usart->reg == USART6) { __HAL_RCC_USART6_CLK_ENABLE(); }
    #endif
    #ifdef UART7
      else if (usart->reg == UART7)  { __HAL_RCC_UART7_CLK_ENABLE();  }
    #endif
    #ifdef UART8
      else if (usart->reg == UART8)  { __HAL_RCC_UART8_CLK_ENABLE();  }
    #endif
    #ifdef UART9
      else if (usart->reg == UART9)  { __HAL_RCC_UART9_CLK_ENABLE();  }
    #endif
    #ifdef UART10
      else if (usart->reg == UART10) { __HAL_RCC_UART10_CLK_ENABLE(); }
    #endif

      // Clear and Enable USART IRQ
      NVIC_ClearPendingIRQ(usart->irq_num);
      NVIC_EnableIRQ(usart->irq_num);

#ifdef __USART_DMA
      if (usart->dma_rx) {
        // Clear and Enable DMA IRQ in NVIC
        NVIC_ClearPendingIRQ(usart->dma_rx->irq_num);
        NVIC_EnableIRQ(usart->dma_rx->irq_num);
      }

      if (usart->dma_tx) {
        // Clear and Enable DMA IRQ in NVIC
        NVIC_ClearPendingIRQ(usart->dma_tx->irq_num);
        NVIC_EnableIRQ(usart->dma_tx->irq_num);
      }
#endif
#else
      switch (usart->vmode) {
#ifdef USART_ASYNC
        case VM_ASYNC:
          ((UART_HandleTypeDef*)usart->h)->Instance = usart->reg;
          HAL_UART_MspInit ((UART_HandleTypeDef*) usart->h);
          break;
#endif
#ifdef USART_SYNC
        case VM_SYNC:
          ((USART_HandleTypeDef*)usart->h)->Instance = usart->reg;
          HAL_USART_MspInit ((USART_HandleTypeDef*) usart->h);
          break;
#endif
#ifdef USART_IRDA
        case VM_IRDA:
          ((IRDA_HandleTypeDef*)usart->h)->Instance = usart->reg;
          HAL_IRDA_MspInit ((IRDA_HandleTypeDef*) usart->h);
          break;
#endif
#ifdef USART_SMARTCARD
        case VM_SMARTCARD:
          ((SMARTCARD_HandleTypeDef*)usart->h)->Instance = usart->reg;
          HAL_SMARTCARD_MspInit ((SMARTCARD_HandleTypeDef*) usart->h);
          break;
#endif
        default: break;
      }
#endif

      // USART peripheral reset
      USART_PeripheralReset (usart->reg);

    break;
  }
  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t USART_Send (const void            *data,
                                         uint32_t         num,
                                   const USART_RESOURCES *usart)
  \brief       Start sending data to USART transmitter.
  \param[in]   data  Pointer to buffer with data to send to USART transmitter
  \param[in]   num   Number of data items to send
  \param[in]   usart Pointer to USART resources
  \return      \ref execution_status
*/
static int32_t USART_Send (const void            *data,
                                 uint32_t         num,
                           const USART_RESOURCES *usart) {
  int32_t stat;

#ifdef __USART_DMA_TX
  uint32_t cr1;
  uint32_t source_inc = DMA_MINC_ENABLE;
#endif

  if ((data == NULL) || (num == 0U)) {
    // Invalid parameters
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  if ((usart->info->flags & USART_FLAG_CONFIGURED) == 0U) {
    // USART is not configured (mode not selected)
    return ARM_DRIVER_ERROR;
  }

  if (usart->xfer->send_active != 0U) {
    // Send is not completed yet
    return ARM_DRIVER_ERROR_BUSY;
  }

  // Set Send active flag
  usart->xfer->send_active = 1U;

  // Save transmit buffer info
  usart->xfer->tx_buf = (uint8_t *)((uint32_t)data);
  usart->xfer->tx_num = num;
  usart->xfer->tx_cnt = 0U;

  // Synchronous mode
  if (usart->info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) {
    if (usart->xfer->sync_mode == 0U) {
      usart->xfer->sync_mode = USART_SYNC_MODE_TX;
      // Start dummy reads
      stat = USART_Receive (&usart->xfer->dump_val, num, usart);
      if (stat == ARM_DRIVER_ERROR_BUSY) { return ARM_DRIVER_ERROR_BUSY; }

#ifdef __USART_DMA_TX
    } else {
      if (usart->xfer->sync_mode == USART_SYNC_MODE_RX) {
        // Dummy DMA writes (do not increment source address)
        source_inc = DMA_MINC_DISABLE;
      }
#endif
    }
  }

#ifdef __USART_DMA_TX
  // DMA mode
  if (usart->dma_tx) {
    // Prepare DMA to send TX data
    usart->dma_tx->hdma->Init.PeriphInc             = DMA_PINC_DISABLE;
    usart->dma_tx->hdma->Init.MemInc                = source_inc;

