Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
// USART5 Driver Control Block
ARM_DRIVER_USART Driver_USART5 = {
    USARTx_GetVersion,
    USART5_GetCapabilities,
    USART5_Initialize,
    USART5_Uninitialize,
    USART5_PowerControl,
    USART5_Send, 
    USART5_Receive,
    USART5_Transfer,
    USART5_GetTxCount,
    USART5_GetRxCount,
    USART5_Control,
    USART5_GetStatus,
    USART5_SetModemControl,
    USART5_GetModemStatus
};
#endif

#ifdef MX_USART6
// USART6 Driver Wrapper functions
static ARM_USART_CAPABILITIES  USART6_GetCapabilities (void)                                                { return USART_GetCapabilities (&USART6_Resources); }
static int32_t                 USART6_Initialize      (ARM_USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &USART6_Resources); }
static int32_t                 USART6_Uninitialize    (void)                                                { return USART_Uninitialize (&USART6_Resources); }
static int32_t                 USART6_PowerControl    (ARM_POWER_STATE state)                               { return USART_PowerControl (state, &USART6_Resources); }
static int32_t                 USART6_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &USART6_Resources); }
static int32_t                 USART6_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &USART6_Resources); }
static int32_t                 USART6_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &USART6_Resources); }
static uint32_t                USART6_GetTxCount      (void)                                                { return USART_GetTxCount (&USART6_Resources); }
static uint32_t                USART6_GetRxCount      (void)                                                { return USART_GetRxCount (&USART6_Resources); }
static int32_t                 USART6_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &USART6_Resources); }
static ARM_USART_STATUS        USART6_GetStatus       (void)                                                { return USART_GetStatus (&USART6_Resources); }
static int32_t                 USART6_SetModemControl (ARM_USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &USART6_Resources); }
static ARM_USART_MODEM_STATUS  USART6_GetModemStatus  (void)                                                { return USART_GetModemStatus (&USART6_Resources); }
       void                    USART6_IRQHandler      (void)                                                {        USART_IRQHandler (&USART6_Resources); }

#ifdef MX_USART6_TX_DMA_Instance
static void                    USART6_TX_DMA_Complete (DMA_HandleTypeDef *hdma)                             { (void)hdma; USART_TX_DMA_Complete(&USART6_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void USART6_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_USART6_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_usart6_tx);
}
#endif
#endif
#ifdef MX_USART6_RX_DMA_Instance
static void                    USART6_RX_DMA_Complete (DMA_HandleTypeDef *hdma)                             { (void)hdma; USART_RX_DMA_Complete(&USART6_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void USART6_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_USART6_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_usart6_rx);
}
#endif
#endif

// USART6 Driver Control Block
ARM_DRIVER_USART Driver_USART6 = {
    USARTx_GetVersion,
    USART6_GetCapabilities,
    USART6_Initialize,
    USART6_Uninitialize,
    USART6_PowerControl,
    USART6_Send, 
    USART6_Receive,
    USART6_Transfer,
    USART6_GetTxCount,
    USART6_GetRxCount,
    USART6_Control,
    USART6_GetStatus,
    USART6_SetModemControl,
    USART6_GetModemStatus
};
#endif

#ifdef MX_UART7
// USART7 Driver Wrapper functions
static ARM_USART_CAPABILITIES  USART7_GetCapabilities (void)                                                { return USART_GetCapabilities (&USART7_Resources); }
static int32_t                 USART7_Initialize      (ARM_USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &USART7_Resources); }
static int32_t                 USART7_Uninitialize    (void)                                                { return USART_Uninitialize (&USART7_Resources); }
static int32_t                 USART7_PowerControl    (ARM_POWER_STATE state)                               { return USART_PowerControl (state, &USART7_Resources); }
static int32_t                 USART7_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &USART7_Resources); }
static int32_t                 USART7_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &USART7_Resources); }
static int32_t                 USART7_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &USART7_Resources); }
static uint32_t                USART7_GetTxCount      (void)                                                { return USART_GetTxCount (&USART7_Resources); }
static uint32_t                USART7_GetRxCount      (void)                                                { return USART_GetRxCount (&USART7_Resources); }
static int32_t                 USART7_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &USART7_Resources); }
static ARM_USART_STATUS        USART7_GetStatus       (void)                                                { return USART_GetStatus (&USART7_Resources); }
static int32_t                 USART7_SetModemControl (ARM_USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &USART7_Resources); }
static ARM_USART_MODEM_STATUS  USART7_GetModemStatus  (void)                                                { return USART_GetModemStatus (&USART7_Resources); }
       void                    UART7_IRQHandler       (void)                                                {        USART_IRQHandler (&USART7_Resources); }

#ifdef MX_UART7_TX_DMA_Instance
static void                    UART7_TX_DMA_Complete (DMA_HandleTypeDef *hdma)                              { (void)hdma; USART_TX_DMA_Complete(&USART7_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void UART7_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_UART7_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_uart7_tx);
}
#endif
#endif
#ifdef MX_UART7_RX_DMA_Instance
static void                    UART7_RX_DMA_Complete (DMA_HandleTypeDef *hdma)                              { (void)hdma; USART_RX_DMA_Complete(&USART7_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void UART7_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_UART7_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_uart7_rx);
}
#endif
#endif

