Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
// USART7 Driver Control Block
ARM_DRIVER_USART Driver_USART7 = {
    USARTx_GetVersion,
    USART7_GetCapabilities,
    USART7_Initialize,
    USART7_Uninitialize,
    USART7_PowerControl,
    USART7_Send, 
    USART7_Receive,
    USART7_Transfer,
    USART7_GetTxCount,
    USART7_GetRxCount,
    USART7_Control,
    USART7_GetStatus,
    USART7_SetModemControl,
    USART7_GetModemStatus
};
#endif

#ifdef MX_UART8
// USART8 Driver Wrapper functions
static ARM_USART_CAPABILITIES  USART8_GetCapabilities (void)                                                { return USART_GetCapabilities (&USART8_Resources); }
static int32_t                 USART8_Initialize      (ARM_USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &USART8_Resources); }
static int32_t                 USART8_Uninitialize    (void)                                                { return USART_Uninitialize (&USART8_Resources); }
static int32_t                 USART8_PowerControl    (ARM_POWER_STATE state)                               { return USART_PowerControl (state, &USART8_Resources); }
static int32_t                 USART8_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &USART8_Resources); }
static int32_t                 USART8_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &USART8_Resources); }
static int32_t                 USART8_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &USART8_Resources); }
static uint32_t                USART8_GetTxCount      (void)                                                { return USART_GetTxCount (&USART8_Resources); }
static uint32_t                USART8_GetRxCount      (void)                                                { return USART_GetRxCount (&USART8_Resources); }
static int32_t                 USART8_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &USART8_Resources); }
static ARM_USART_STATUS        USART8_GetStatus       (void)                                                { return USART_GetStatus (&USART8_Resources); }
static int32_t                 USART8_SetModemControl (ARM_USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &USART8_Resources); }
static ARM_USART_MODEM_STATUS  USART8_GetModemStatus  (void)                                                { return USART_GetModemStatus (&USART8_Resources); }
       void                    UART8_IRQHandler       (void)                                                {        USART_IRQHandler (&USART8_Resources); }
#ifdef MX_UART8_TX_DMA_Instance
static void                    UART8_TX_DMA_Complete (DMA_HandleTypeDef *hdma)                              { (void)hdma; USART_TX_DMA_Complete(&USART8_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void UART8_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_UART8_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_uart8_tx);
}
#endif
#endif
#ifdef MX_UART8_RX_DMA_Instance
static void                    UART8_RX_DMA_Complete (DMA_HandleTypeDef *hdma)                              { (void)hdma; USART_RX_DMA_Complete(&USART8_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void UART8_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_UART8_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_uart8_rx);
}
#endif
#endif

// USART8 Driver Control Block
ARM_DRIVER_USART Driver_USART8 = {
    USARTx_GetVersion,
    USART8_GetCapabilities,
    USART8_Initialize,
    USART8_Uninitialize,
    USART8_PowerControl,
    USART8_Send, 
    USART8_Receive,
    USART8_Transfer,
    USART8_GetTxCount,
    USART8_GetRxCount,
    USART8_Control,
    USART8_GetStatus,
    USART8_SetModemControl,
    USART8_GetModemStatus
};
#endif

#ifdef MX_UART9
// USART9 Driver Wrapper functions
static ARM_USART_CAPABILITIES  USART9_GetCapabilities (void)                                                { return USART_GetCapabilities (&USART9_Resources); }
static int32_t                 USART9_Initialize      (ARM_USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &USART9_Resources); }
static int32_t                 USART9_Uninitialize    (void)                                                { return USART_Uninitialize (&USART9_Resources); }
static int32_t                 USART9_PowerControl    (ARM_POWER_STATE state)                               { return USART_PowerControl (state, &USART9_Resources); }
static int32_t                 USART9_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &USART9_Resources); }
static int32_t                 USART9_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &USART9_Resources); }
static int32_t                 USART9_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &USART9_Resources); }
static uint32_t                USART9_GetTxCount      (void)                                                { return USART_GetTxCount (&USART9_Resources); }
static uint32_t                USART9_GetRxCount      (void)                                                { return USART_GetRxCount (&USART9_Resources); }
static int32_t                 USART9_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &USART9_Resources); }
static ARM_USART_STATUS        USART9_GetStatus       (void)                                                { return USART_GetStatus (&USART9_Resources); }
static int32_t                 USART9_SetModemControl (ARM_USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &USART9_Resources); }
static ARM_USART_MODEM_STATUS  USART9_GetModemStatus  (void)                                                { return USART_GetModemStatus (&USART9_Resources); }
       void                    UART9_IRQHandler       (void)                                                {        USART_IRQHandler (&USART9_Resources); }
#ifdef MX_UART9_TX_DMA_Instance
static void                    UART8_TX_DMA_Complete (DMA_HandleTypeDef *hdma)                              {        USART_TX_DMA_Complete(&USART9_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void UART9_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_UART9_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_uart9_tx);
}
#endif
#endif
#ifdef MX_UART9_RX_DMA_Instance
static void                    UART9_RX_DMA_Complete (DMA_HandleTypeDef *hdma)                              {        USART_RX_DMA_Complete(&USART9_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void UART9_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_UART9_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_uart9_rx);
}
#endif
#endif

