Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.c
// USART9 Driver Control Block
ARM_DRIVER_USART Driver_USART9 = {
    USARTx_GetVersion,
    USART9_GetCapabilities,
    USART9_Initialize,
    USART9_Uninitialize,
    USART9_PowerControl,
    USART9_Send, 
    USART9_Receive,
    USART9_Transfer,
    USART9_GetTxCount,
    USART9_GetRxCount,
    USART9_Control,
    USART9_GetStatus,
    USART9_SetModemControl,
    USART9_GetModemStatus
};
#endif

#ifdef MX_UART10
// USART10 Driver Wrapper functions
static ARM_USART_CAPABILITIES  USART10_GetCapabilities (void)                                                { return USART_GetCapabilities (&USART10_Resources); }
static int32_t                 USART10_Initialize      (ARM_USART_SignalEvent_t cb_event)                    { return USART_Initialize (cb_event, &USART10_Resources); }
static int32_t                 USART10_Uninitialize    (void)                                                { return USART_Uninitialize (&USART10_Resources); }
static int32_t                 USART10_PowerControl    (ARM_POWER_STATE state)                               { return USART_PowerControl (state, &USART10_Resources); }
static int32_t                 USART10_Send            (const void *data, uint32_t num)                      { return USART_Send (data, num, &USART10_Resources); }
static int32_t                 USART10_Receive         (void *data, uint32_t num)                            { return USART_Receive (data, num, &USART10_Resources); }
static int32_t                 USART10_Transfer        (const void *data_out, void *data_in, uint32_t num)   { return USART_Transfer (data_out, data_in, num, &USART10_Resources); }
static uint32_t                USART10_GetTxCount      (void)                                                { return USART_GetTxCount (&USART10_Resources); }
static uint32_t                USART10_GetRxCount      (void)                                                { return USART_GetRxCount (&USART10_Resources); }
static int32_t                 USART10_Control         (uint32_t control, uint32_t arg)                      { return USART_Control (control, arg, &USART10_Resources); }
static ARM_USART_STATUS        USART10_GetStatus       (void)                                                { return USART_GetStatus (&USART10_Resources); }
static int32_t                 USART10_SetModemControl (ARM_USART_MODEM_CONTROL control)                     { return USART_SetModemControl (control, &USART10_Resources); }
static ARM_USART_MODEM_STATUS  USART10_GetModemStatus  (void)                                                { return USART_GetModemStatus (&USART10_Resources); }
       void                    UART10_IRQHandler       (void)                                                {        USART_IRQHandler (&USART10_Resources); }
#ifdef MX_UART8_TX_DMA_Instance
static void                    UART8_TX_DMA_Complete (DMA_HandleTypeDef *hdma)                               {        USART_TX_DMA_Complete(&USART10_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void UART10_TX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_UART10_TX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_uart10_tx);
}
#endif
#endif
#ifdef MX_UART10_RX_DMA_Instance
static void                    UART10_RX_DMA_Complete (DMA_HandleTypeDef *hdma)                              {        USART_RX_DMA_Complete(&USART10_Resources); }

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
void UART10_RX_DMA_Handler (void) {
  HAL_NVIC_ClearPendingIRQ(MX_UART10_RX_DMA_IRQn);
  HAL_DMA_IRQHandler(&hdma_uart10_rx);
}
#endif
#endif

// USART10 Driver Control Block
ARM_DRIVER_USART Driver_USART10 = {
    USARTx_GetVersion,
    USART10_GetCapabilities,
    USART10_Initialize,
    USART10_Uninitialize,
    USART10_PowerControl,
    USART10_Send, 
    USART10_Receive,
    USART10_Transfer,
    USART10_GetTxCount,
    USART10_GetRxCount,
    USART10_Control,
    USART10_GetStatus,
    USART10_SetModemControl,
    USART10_GetModemStatus
};
#endif

/*! \endcond */
